app/views/users/_info.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."user_id" = ?  [["user_id", 1]]
---
	  <th>コメント数</th>
	  <th><%= user.book_comments.count %></th>