app/views/books/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  		  <tr>
          <td><%= link_to(User.find(@book.user_id)) do %>
            <%= image_tag User.find(@book.user_id).get_profile_image, size:"100x100" %><br>
            <%= User.find(@book.user_id).name %>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          <% end %>
          <td>コメント数：<%= @book.book_comments.count %></td>