app/controllers/book_comments_controller.rb

  def create
    #book = Book.find(params[:book_id])
    #comment = current_user.book_comments.new(book_comment_params)
    #comment.book_id = book.id
    #comment.save
    #######redirect_to book_path(book)

    @book = Book.find(params[:book_id]) #コメントする投稿id
    #@book_comment = current_user.book_comments.new(book_comment_params)に省略できる。 誰が投稿、コメントのデータ
    @comment = BookComment.new(book_comment_params)
    @comment.user_id = current_user.id
    @comment.book_id = @book.id #どの投稿にコメントするか
    @comment_new = BookComment.new
    if @comment.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ひんこん"], ["user_id", 1], ["book_id", 1], ["created_at", "2022-05-12 12:17:53.724493"], ["updated_at", "2022-05-12 12:17:53.724493"]]

  def destroy
    #BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
    #redirect_to book_path(params[:book_id])
    comment = BookComment.find(params[:id])
    @book = Book.find(params[:book_id]) #詳しくidを指定
    @comment_new = BookComment.new
    comment.destroy
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 22]]