app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
  def destroy
    @book = Book.find(params[:id])
    @book.delete