app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = Book.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "わくわくくろくま"], ["introduction", "実はしろです。"], ["updated_at", "2022-05-09 22:51:48.435157"], ["id", 1]]

  def following
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def followed
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]