app/models/user.rb

SELECT 1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = ? AND "users"."id" = ? LIMIT ?  [["follower_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def following?(user)
    follower_user.include?(user)